# LightingCalculationWorkplane Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Space..::..LightingCalculationWorkplane Property
Space Class See Also
---
Get or set the Lighting Calculation Workplane of the Space.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double LightingCalculationWorkplane { get; set; }
```

Visual Basic
---
```text
Public Property LightingCalculationWorkplane As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double LightingCalculationWorkplane {
	double get ();
	void set (double value);
}
```

# Remarks
This property is used to get or set the Lighting Calculation Workplane (Unit: feet) of the Space.
# See Also
Space Class
Autodesk.Revit.DB.Mechanical Namespace